src/InformationRegisters/БЗ_СвязьКомментариевБазыЗнаний/БЗ_СвязьКомментариевБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БЗ_СвязьКомментариевБазыЗнаний</name>
  <dimensions>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.БЗ_КомментарииБазыЗнаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.БЗ_КомментарииБазыЗнаний</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/БЗ_СвязьКомментариевБазыЗнаний/ManagerModule.bsl
Процедура УстановитьСвязь(знач РодительСсылка, знач ПодчиненныйСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(РодительСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.БЗ_СвязьКомментариевБазыЗнаний.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Родитель = РодительСсылка;
	МенеджерЗаписи.Ссылка	= ПодчиненныйСсылка;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура ОчиститьСвязь(знач РодительСсылка, знач ПодчиненныйСсылка) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.БЗ_СвязьКомментариевБазыЗнаний.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Родитель = РодительСсылка;
	МенеджерЗаписи.Ссылка	= ПодчиненныйСсылка;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры
